RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_flash.c
/********************************** (C) COPYRIGHT  *******************************
* File Name          : ch32f20x_flash.c
* Author             : WCH
* Version            : V1.0.0
* Date               : 2021/08/08
* Description        : This file provides all the FLASH firmware functions.
***************************************************************************************/
#include "ch32f20x_flash.h"

/* Flash Access Control Register bits */
#define ACR_LATENCY_Mask         ((uint32_t)0x00000038)
#define ACR_HLFCYA_Mask          ((uint32_t)0xFFFFFFF7)
#define ACR_PRFTBE_Mask          ((uint32_t)0xFFFFFFEF)

/* Flash Access Control Register bits */
#define ACR_PRFTBS_Mask          ((uint32_t)0x00000020) 

/* Flash Control Register bits */
#define CR_PG_Set                ((uint32_t)0x00000001)
#define CR_PG_Reset              ((uint32_t)0x00001FFE) 
#define CR_PER_Set               ((uint32_t)0x00000002)
#define CR_PER_Reset             ((uint32_t)0x00001FFD)
#define CR_MER_Set               ((uint32_t)0x00000004)
#define CR_MER_Reset             ((uint32_t)0x00001FFB)
#define CR_OPTPG_Set             ((uint32_t)0x00000010)
#define CR_OPTPG_Reset           ((uint32_t)0x00001FEF)
#define CR_OPTER_Set             ((uint32_t)0x00000020)
#define CR_OPTER_Reset           ((uint32_t)0x00001FDF)
#define CR_STRT_Set              ((uint32_t)0x00000040)
#define CR_LOCK_Set              ((uint32_t)0x00000080)
#define CR_FAST_LOCK_Set         ((uint32_t)0x00008000)
#define CR_PAGE_PG 	             ((uint32_t)0x00010000)
#define CR_PAGE_ER				       ((uint32_t)0x00020000)
#define CR_BER32 	               ((uint32_t)0x00040000)
#define CR_BER64 			           ((uint32_t)0x00080000)
#define CR_PG_STRT               ((uint32_t)0x00200000)

/* FLASH Status Register bits */
#define SR_BSY 					         ((uint32_t)0x00000001)
#define SR_WR_BSY 			         ((uint32_t)0x00000002)
#define SR_WRPRTERR 		         ((uint32_t)0x00000010)
#define SR_EOP 					         ((uint32_t)0x00000020)

/* FLASH Mask */
#define RDPRT_Mask               ((uint32_t)0x00000002)
#define WRP0_Mask                ((uint32_t)0x000000FF)
#define WRP1_Mask                ((uint32_t)0x0000FF00)
#define WRP2_Mask                ((uint32_t)0x00FF0000)
#define WRP3_Mask                ((uint32_t)0xFF000000)
#define OB_USER_BFB2             ((uint16_t)0x0008)

/* FLASH Keys */
#define RDP_Key                  ((uint16_t)0x00A5)
#define FLASH_KEY1               ((uint32_t)0x45670123)
#define FLASH_KEY2               ((uint32_t)0xCDEF89AB)

/* FLASH BANK address */
#define FLASH_BANK1_END_ADDRESS  ((uint32_t)0x807FFFF)

/* Delay definition */   
#define EraseTimeout             ((uint32_t)0x000B0000)
#define ProgramTimeout           ((uint32_t)0x00005000)

/********************************************************************************
* Function Name  : FLASH_SetLatency
* Description    : Sets the code latency value. 
* Input          : FLASH_Latency: specifies the FLASH Latency value.
*                    FLASH_Latency_0: FLASH Zero Latency cycle
*                    FLASH_Latency_1: FLASH One Latency cycle
*                    FLASH_Latency_2: FLASH Two Latency cycles
* Return         : None
*********************************************************************************/
void FLASH_SetLatency(uint32_t FLASH_Latency)
{
  uint32_t tmpreg = 0;
  
  tmpreg = FLASH->ACTLR;  
  tmpreg &= ACR_LATENCY_Mask;
  tmpreg |= FLASH_Latency;
  FLASH->ACTLR = tmpreg;
}


/********************************************************************************
* Function Name  : FLASH_HalfCycleAccessCmd
* Description    : Enables or disables the Half cycle flash access. 
* Input          : FLASH_HalfCycleAccess: specifies the FLASH Half cycle Access mode.
*                    FLASH_HalfCycleAccess_Enable: FLASH Half Cycle Enable
*                    FLASH_HalfCycleAccess_Disable: FLASH Half Cycle Disable
* Return         : None
*********************************************************************************/
void FLASH_HalfCycleAccessCmd(uint32_t FLASH_HalfCycleAccess)
{
  FLASH->ACTLR &= ACR_HLFCYA_Mask;
  FLASH->ACTLR |= FLASH_HalfCycleAccess;
}

/********************************************************************************
* Function Name  : FLASH_PrefetchBufferCmd
* Description    : Enables or disables the Prefetch Buffer.
* Input          : FLASH_PrefetchBuffer: specifies the Prefetch buffer status.
*                    FLASH_PrefetchBuffer_Enable: FLASH Prefetch Buffer Enable
*                    FLASH_PrefetchBuffer_Disable: FLASH Prefetch Buffer Disable
* Return         : None
*********************************************************************************/
void FLASH_PrefetchBufferCmd(uint32_t FLASH_PrefetchBuffer)
{
  FLASH->ACTLR &= ACR_PRFTBE_Mask;
  FLASH->ACTLR |= FLASH_PrefetchBuffer;
}


/********************************************************************************
* Function Name  : FLASH_Unlock
* Description    : Unlocks the FLASH Program Erase Controller.
* Input          : None
* Return         : None
*********************************************************************************/
void FLASH_Unlock(void)
{
  /* Authorize the FPEC of Bank1 Access */
  FLASH->KEYR = FLASH_KEY1;
  FLASH->KEYR = FLASH_KEY2;
}


/********************************************************************************
* Function Name  : FLASH_UnlockBank1
* Description    : Unlocks the FLASH Bank1 Program Erase Controller.
*                  equivalent to FLASH_Unlock function.
* Input          : None
* Return         : None
*********************************************************************************/
void FLASH_UnlockBank1(void)
{
  FLASH->KEYR = FLASH_KEY1;
  FLASH->KEYR = FLASH_KEY2;
}

/********************************************************************************
* Function Name  : FLASH_Lock
* Description    : Locks the FLASH Program Erase Controller.
* Input          : None
* Return         : None
*********************************************************************************/
void FLASH_Lock(void)
{
  FLASH->CTLR |= CR_LOCK_Set;
}

/********************************************************************************
* Function Name  : FLASH_LockBank1
* Description    : Locks the FLASH Bank1 Program Erase Controller.
* Input          : None
* Return         : None
*********************************************************************************/
void FLASH_LockBank1(void)
{
  FLASH->CTLR |= CR_LOCK_Set;
}


/********************************************************************************
* Function Name  : FLASH_ErasePage
* Description    : Erases a specified FLASH page(page size 4KB).
* Input          : Page_Address: The page address to be erased.
* Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
*                  FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
*********************************************************************************/
FLASH_Status FLASH_ErasePage(uint32_t Page_Address)
{
  FLASH_Status status = FLASH_COMPLETE;

  status = FLASH_WaitForLastOperation(EraseTimeout);
  
