RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_flash.c
  return status;
}

/********************************************************************************
* Function Name  : FLASH_EnableWriteProtection
* Description    : Write protects the desired pages
* Input          : FLASH_Pages: specifies the address of the pages to be write protected.
* Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
*                  FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
*********************************************************************************/
FLASH_Status FLASH_EnableWriteProtection(uint32_t FLASH_Pages)
{
  uint16_t WRP0_Data = 0xFFFF, WRP1_Data = 0xFFFF, WRP2_Data = 0xFFFF, WRP3_Data = 0xFFFF;
  
  FLASH_Status status = FLASH_COMPLETE;
  
  FLASH_Pages = (uint32_t)(~FLASH_Pages);
  WRP0_Data = (uint16_t)(FLASH_Pages & WRP0_Mask);
  WRP1_Data = (uint16_t)((FLASH_Pages & WRP1_Mask) >> 8);
  WRP2_Data = (uint16_t)((FLASH_Pages & WRP2_Mask) >> 16);
  WRP3_Data = (uint16_t)((FLASH_Pages & WRP3_Mask) >> 24);
  
  status = FLASH_WaitForLastOperation(ProgramTimeout);
  
  if(status == FLASH_COMPLETE)
  {
    FLASH->OBKEYR = FLASH_KEY1;
    FLASH->OBKEYR = FLASH_KEY2;
    FLASH->CTLR |= CR_OPTPG_Set;
    if(WRP0_Data != 0xFF)
    {
      OB->WRPR0 = WRP0_Data;
      status = FLASH_WaitForLastOperation(ProgramTimeout);
    }
    if((status == FLASH_COMPLETE) && (WRP1_Data != 0xFF))
    {
      OB->WRPR1 = WRP1_Data;
      status = FLASH_WaitForLastOperation(ProgramTimeout);
    }
    if((status == FLASH_COMPLETE) && (WRP2_Data != 0xFF))
    {
      OB->WRPR2 = WRP2_Data;
      status = FLASH_WaitForLastOperation(ProgramTimeout);
    }
    
    if((status == FLASH_COMPLETE)&& (WRP3_Data != 0xFF))
    {
      OB->WRPR3 = WRP3_Data;
      status = FLASH_WaitForLastOperation(ProgramTimeout);
    }
          
    if(status != FLASH_TIMEOUT)
    {
      FLASH->CTLR &= CR_OPTPG_Reset;
    }
  } 
  return status;       
}

/********************************************************************************
* Function Name  : FLASH_ReadOutProtection
* Description    : Enables or disables the read out protection.
* Input          : Newstate: new state of the ReadOut Protection(ENABLE or DISABLE).
* Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
*                  FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
*********************************************************************************/
FLASH_Status FLASH_ReadOutProtection(FunctionalState NewState)
{
  FLASH_Status status = FLASH_COMPLETE;
  status = FLASH_WaitForLastOperation(EraseTimeout);
  if(status == FLASH_COMPLETE)
  {
    FLASH->OBKEYR = FLASH_KEY1;
    FLASH->OBKEYR = FLASH_KEY2;
    FLASH->CTLR |= CR_OPTER_Set;
    FLASH->CTLR |= CR_STRT_Set;
    status = FLASH_WaitForLastOperation(EraseTimeout);
    if(status == FLASH_COMPLETE)
    {
      FLASH->CTLR &= CR_OPTER_Reset;
      FLASH->CTLR |= CR_OPTPG_Set; 
      if(NewState != DISABLE)
      {
        OB->RDPR = 0x00;
      }
      else
      {
        OB->RDPR = RDP_Key;  
      }
      status = FLASH_WaitForLastOperation(EraseTimeout); 
    
      if(status != FLASH_TIMEOUT)
      {
        FLASH->CTLR &= CR_OPTPG_Reset;
      }
    }
    else 
    {
      if(status != FLASH_TIMEOUT)
      {
        FLASH->CTLR &= CR_OPTER_Reset;
      }
    }
  }
  return status;       
}

/********************************************************************************
* Function Name  : FLASH_UserOptionByteConfig
* Description    : Programs the FLASH User Option Byte: IWDG_SW / RST_STOP / RST_STDBY.
* Input          : OB_IWDG: Selects the IWDG mode
*                     OB_IWDG_SW: Software IWDG selected
*                     OB_IWDG_HW: Hardware IWDG selected
*                  OB_STOP: Reset event when entering STOP mode.
*                     OB_STOP_NoRST: No reset generated when entering in STOP
*                     OB_STOP_RST: Reset generated when entering in STOP
*                  OB_STDBY: Reset event when entering Standby mode.
*                     OB_STDBY_NoRST: No reset generated when entering in STANDBY
*                     OB_STDBY_RST: Reset generated when entering in STANDBY
* Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
*                  FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
*********************************************************************************/
FLASH_Status FLASH_UserOptionByteConfig(uint16_t OB_IWDG, uint16_t OB_STOP, uint16_t OB_STDBY)
{
  FLASH_Status status = FLASH_COMPLETE; 

  FLASH->OBKEYR = FLASH_KEY1;
  FLASH->OBKEYR = FLASH_KEY2;
  status = FLASH_WaitForLastOperation(ProgramTimeout);
  
  if(status == FLASH_COMPLETE)
  {  
    FLASH->CTLR |= CR_OPTPG_Set; 
           
    OB->USER = OB_IWDG | (uint16_t)(OB_STOP | (uint16_t)(OB_STDBY | ((uint16_t)0xF8))); 
  
    status = FLASH_WaitForLastOperation(ProgramTimeout);
    if(status != FLASH_TIMEOUT)
    {
      FLASH->CTLR &= CR_OPTPG_Reset;
    }
  }    
  return status;
}

/********************************************************************************
* Function Name  : FLASH_GetUserOptionByte
* Description    : Returns the FLASH User Option Bytes values.
* Input          : None
* Return         : The FLASH User Option Bytes values:IWDG_SW(Bit0), RST_STOP(Bit1)
*                  and RST_STDBY(Bit2).
*********************************************************************************/
uint32_t FLASH_GetUserOptionByte(void)
{
  return (uint32_t)(FLASH->OBR >> 2);
}


/********************************************************************************
* Function Name  : FLASH_GetWriteProtectionOptionByte
* Description    : Returns the FLASH Write Protection Option Bytes Register value.
* Input          : None
* Return         : The FLASH Write Protection  Option Bytes Register value
*********************************************************************************/
uint32_t FLASH_GetWriteProtectionOptionByte(void)
{
  return (uint32_t)(FLASH->WPR);
}


/********************************************************************************
* Function Name  : FLASH_GetReadOutProtectionStatus
* Description    : Checks whether the FLASH Read Out Protection Status is set or not.
* Input          : None
* Return         : FLASH ReadOut Protection Status(SET or RESET)
*********************************************************************************/
FlagStatus FLASH_GetReadOutProtectionStatus(void)
{
  FlagStatus readoutstatus = RESET;
  if ((FLASH->OBR & RDPRT_Mask) != (uint32_t)RESET)
  {
    readoutstatus = SET;
  }
  else
  {
    readoutstatus = RESET;
  }
  return readoutstatus;
}

/********************************************************************************
* Function Name  : FLASH_GetPrefetchBufferStatus
* Description    : Checks whether the FLASH Prefetch Buffer status is set or not.
* Input          : None
* Return         : FLASH Prefetch Buffer Status (SET or RESET).
*********************************************************************************/
FlagStatus FLASH_GetPrefetchBufferStatus(void)
{
  FlagStatus bitstatus = RESET;
  
  if ((FLASH->ACTLR & ACR_PRFTBS_Mask) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus; 
}

/********************************************************************************
* Function Name  : FLASH_ITConfig
* Description    : Enables or disables the specified FLASH interrupts.
* Input          : FLASH_IT: specifies the FLASH interrupt sources to be enabled or disabled.
*                    FLASH_IT_ERROR: FLASH Error Interrupt
*                    FLASH_IT_EOP: FLASH end of operation Interrupt
*                  NewState: new state of the specified Flash interrupts(ENABLE or DISABLE).
* Return         : FLASH Prefetch Buffer Status (SET or RESET).
*********************************************************************************/
void FLASH_ITConfig(uint32_t FLASH_IT, FunctionalState NewState)
{
  if(NewState != DISABLE)
  {
    FLASH->CTLR |= FLASH_IT;
  }
  else
  {
    FLASH->CTLR &= ~(uint32_t)FLASH_IT;
  }
}


/********************************************************************************
* Function Name  : FLASH_GetFlagStatus
* Description    : Checks whether the specified FLASH flag is set or not.
* Input          : FLASH_FLAG: specifies the FLASH flag to check.
*                    FLASH_FLAG_BSY: FLASH Busy flag  
*                    FLASH_FLAG_PGERR: FLASH Program error flag   
*                    FLASH_FLAG_WRPRTERR: FLASH Write protected error flag    
*                    FLASH_FLAG_EOP: FLASH End of Operation flag 
*                    FLASH_FLAG_OPTERR:  FLASH Option Byte error flag 
* Return         : The new state of FLASH_FLAG (SET or RESET).
*********************************************************************************/
FlagStatus FLASH_GetFlagStatus(uint32_t FLASH_FLAG)
{
  FlagStatus bitstatus = RESET;

  if(FLASH_FLAG == FLASH_FLAG_OPTERR) 
  {
    if((FLASH->OBR & FLASH_FLAG_OPTERR) != (uint32_t)RESET)
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }
  else
  {
   if((FLASH->STATR & FLASH_FLAG) != (uint32_t)RESET)
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }
  return bitstatus;
}

/********************************************************************************
* Function Name  : FLASH_ClearFlag
* Description    : Clears the FLASH's pending flags.
* Input          : FLASH_FLAG: specifies the FLASH flags to clear.
*                    FLASH_FLAG_PGERR: FLASH Program error flag   
*                    FLASH_FLAG_WRPRTERR: FLASH Write protected error flag   
*                    FLASH_FLAG_EOP: FLASH End of Operation flag    
* Return         : None
*********************************************************************************/
void FLASH_ClearFlag(uint32_t FLASH_FLAG)
{

  FLASH->STATR = FLASH_FLAG;

