RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_flash.c
}

/********************************************************************************
* Function Name  : FLASH_GetStatus
* Description    : Returns the FLASH Status.
* Input          : None   
* Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
*                                FLASH_ERROR_WRP or FLASH_COMPLETE.
*********************************************************************************/
FLASH_Status FLASH_GetStatus(void)
{
  FLASH_Status flashstatus = FLASH_COMPLETE;
  
  if((FLASH->STATR & FLASH_FLAG_BSY) == FLASH_FLAG_BSY) 
  {
    flashstatus = FLASH_BUSY;
  }
  else 
  {  
    if((FLASH->STATR & FLASH_FLAG_PGERR) != 0)
    { 
      flashstatus = FLASH_ERROR_PG;
    }
    else 
    {
      if((FLASH->STATR & FLASH_FLAG_WRPRTERR) != 0 )
      {
        flashstatus = FLASH_ERROR_WRP;
      }
      else
      {
        flashstatus = FLASH_COMPLETE;
      }
    }
  }
  return flashstatus;
}

/********************************************************************************
* Function Name  : FLASH_GetBank1Status
* Description    : Returns the FLASH Bank1 Status.
* Input          : None   
* Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
*                                FLASH_ERROR_WRP or FLASH_COMPLETE.
*********************************************************************************/
FLASH_Status FLASH_GetBank1Status(void)
{
  FLASH_Status flashstatus = FLASH_COMPLETE;
  
  if((FLASH->STATR & FLASH_FLAG_BANK1_BSY) == FLASH_FLAG_BSY) 
  {
    flashstatus = FLASH_BUSY;
  }
  else 
  {  
    if((FLASH->STATR & FLASH_FLAG_BANK1_PGERR) != 0)
    { 
      flashstatus = FLASH_ERROR_PG;
    }
    else 
    {
      if((FLASH->STATR & FLASH_FLAG_BANK1_WRPRTERR) != 0 )
      {
        flashstatus = FLASH_ERROR_WRP;
      }
      else
      {
        flashstatus = FLASH_COMPLETE;
      }
    }
  }
  return flashstatus;
}


/********************************************************************************
* Function Name  : FLASH_WaitForLastOperation
* Description    : Waits for a Flash operation to complete or a TIMEOUT to occur.
* Input          : Timeout: FLASH programming Timeout   
* Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
*                                FLASH_ERROR_WRP or FLASH_COMPLETE.
*********************************************************************************/
FLASH_Status FLASH_WaitForLastOperation(uint32_t Timeout)
{ 
  FLASH_Status status = FLASH_COMPLETE;
   
  status = FLASH_GetBank1Status();
  while((status == FLASH_BUSY) && (Timeout != 0x00))
  {
    status = FLASH_GetBank1Status();
    Timeout--;
  }
  if(Timeout == 0x00 )
  {
    status = FLASH_TIMEOUT;
  }
  return status;
}


/********************************************************************************
* Function Name  : FLASH_WaitForLastBank1Operation
* Description    : Waits for a Flash operation on Bank1 to complete or a TIMEOUT to occur.
* Input          : Timeout: FLASH programming Timeout   
* Return         : FLASH Status: The returned value can be: FLASH_ERROR_PG,
*                                FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
*********************************************************************************/
FLASH_Status FLASH_WaitForLastBank1Operation(uint32_t Timeout)
{ 
  FLASH_Status status = FLASH_COMPLETE;
   
  status = FLASH_GetBank1Status();
  while((status == FLASH_FLAG_BANK1_BSY) && (Timeout != 0x00))
  {
    status = FLASH_GetBank1Status();
    Timeout--;
  }
  if(Timeout == 0x00 )
  {
    status = FLASH_TIMEOUT;
  }
  return status;
}

/********************************************************************************
* Function Name  : FLASH_Unlock_Fast
* Description    : Unlocks the Fast Program Erase Mode.
* Input          : None
* Return         : None
*********************************************************************************/
void FLASH_Unlock_Fast(void)
{
  /* Authorize the FPEC of Bank1 Access */
  FLASH->KEYR = FLASH_KEY1;
  FLASH->KEYR = FLASH_KEY2;
	
    /* Fast program mode unlock */
    FLASH->MODEKEYR = FLASH_KEY1;
    FLASH->MODEKEYR = FLASH_KEY2;
}

/********************************************************************************
* Function Name  : FLASH_Lock_Fast
* Description    : Locks the Fast Program Erase Mode.
* Input          : None
* Return         : None
*********************************************************************************/
void FLASH_Lock_Fast(void)
{
  FLASH->CTLR |= CR_LOCK_Set;
}

/********************************************************************************
* Function Name  : FLASH_ErasePage_Fast
* Description    : Erases a specified FLASH page (1page = 256Byte).
* Input          : Page_Address: The page address to be erased.
* Return         : None
*********************************************************************************/
void FLASH_ErasePage_Fast(uint32_t Page_Address)
{
    Page_Address &= 0xFFFFFF00;

    FLASH->CTLR |= CR_PAGE_ER;
    FLASH->ADDR = Page_Address;
    FLASH->CTLR |= CR_STRT_Set;
    while(FLASH->STATR & SR_BSY);
    FLASH->CTLR &= ~CR_PAGE_ER;
}

/********************************************************************************
* Function Name  : FLASH_EraseBlock_32K_Fast
* Description    : Erases a specified FLASH Block (1Block = 32KByte).
* Input          : Block_Address: The block address to be erased.
* Return         : None
*********************************************************************************/
void FLASH_EraseBlock_32K_Fast(uint32_t Block_Address)
{
    Block_Address &= 0xFFFF8000;

    FLASH->CTLR |= CR_BER32;
    FLASH->ADDR = Block_Address;
    FLASH->CTLR |= CR_STRT_Set;
    while(FLASH->STATR & SR_BSY);
    FLASH->CTLR &= ~CR_BER32;
}

/********************************************************************************
* Function Name  : FLASH_EraseBlock_64K_Fast
* Description    : Erases a specified FLASH Block (1Block = 64KByte).
* Input          : Block_Address: The block address to be erased.
* Return         : None
*********************************************************************************/
void FLASH_EraseBlock_64K_Fast(uint32_t Block_Address)
{
    Block_Address &= 0xFFFF0000;

    FLASH->CTLR |= CR_BER64;
    FLASH->ADDR = Block_Address;
    FLASH->CTLR |= CR_STRT_Set;
    while(FLASH->STATR & SR_BSY);
    FLASH->CTLR &= ~CR_BER64;
}

/********************************************************************************
* Function Name  : FLASH_ProgramPage_Fast
* Description    : Program a specified FLASH page (1page = 256Byte).
* Input          : Page_Address: The page address to be programed.
* Return         : None
*********************************************************************************/
void FLASH_ProgramPage_Fast(uint32_t Page_Address, uint32_t*pbuf)
{
    uint8_t size=64;

    Page_Address &= 0xFFFFFF00;

    FLASH->CTLR |= CR_PAGE_PG;
    while(FLASH->STATR & SR_BSY);
    while(FLASH->STATR & SR_WR_BSY);

    while(size)
    {
        *(uint32_t*)Page_Address = *(uint32_t*)pbuf;
        Page_Address += 4;
        pbuf += 1;
        size -= 1;
        while (FLASH->STATR & SR_WR_BSY);
    }

    FLASH->CTLR |= CR_PG_STRT;
    while(FLASH->STATR & SR_BSY);
    FLASH->CTLR &= ~CR_PAGE_PG;
}
